class петь():
    def песня_про_какашку_и_говняшку():
        print('govno kakashkaaaaaaaaa jopa jopa piska')

    def klazermp3():
        print('lox idi nafig ya ne pridumal')

    def рустам():
        print('ты тупой даун который верит в тупого рустама который срет и который срет говно и '
                'который съел литр бургеров и аооаоаоаоаоаоаоаажжажажажажжфжфжфжфжфжфжфыыыыыыыыыыыыыыыыыыыыыыыыыыыы '
                'яойчег я смотрю ведь я тупой еблан и сасать хуй член в жопу сувать и орать и литающий казел окак '
                'аххахахахахахах ах ах ах ах дилдаки в жопу летят и москву разбомбят ведь они жопы письки попки жопки '
                'моча мошонка пизда клитор влагалище вагина головка сперма жопа анальные волосы анус яичники яйца уретра '
                'смегма = творожок и я лол кек диана тупая а ты лол морв он лох и рустам ест тупой гарох и смузи битс '
                'гавно кушашашашашашаашшать ведь я шашашашашашшашашаша')