Repository: pypi-data/pypi-mirror-382
Catalog: packages/nautilus-open-any-terminal/nautilus_open_any_terminal-0.7.0.tar.gz/nautilus_open_any_terminal-0.7.0/nautilus_open_any_terminal/locale/*.po
Languages: sw

source: Open in Remote {}
sw: Fungua katika {} ya mbali

source: Open Remote {} in {}
sw: Fungua {} ya mbali katika {}

source: Open in Local {}
sw: Fungua katika {} ya karibu

source: Open Local {} in {}
sw: Fungua {} ya karibu katika {}

source: Open Remote {} Here
sw: Fungua {} ya mbali hapa

source: Open Remote {} in This Directory
sw: Fungua {} ya mbali katika saraka hii

source: Open Local {} Here
sw: Fungua {} ya karibu hapa

source: Open Local {} in This Directory
sw: Fungua {} ya karibu katika saraka hii

source: Open Remote {}
sw: Fungua Remote {}

source: Open in {}
sw: Fungua katika {}

source: Open {} in {}
sw: Fungua {} katika {}

source: Open {} Here
sw: Fungua {} hapa

source: Open {} in This Directory
sw: Fungua {} katika saraka hii

source: Execute in Remote {}
sw: Tekeleza katika {} ya mbali

source: Execute {} in {} via SSH
sw: Tekeleza {} katika {} kupitia SSH

source: Execute in Local {}
sw: Tekeleza katika {} ya karibu

source: Execute {} in Local {}
sw: Tekeleza {} katika {} ya karibu

source: Execute in {}
sw: Tekeleza katika {}

source: Execute {} in {}
sw: Tekeleza {} katika {}
