Repository: pypi-data/pypi-mirror-382
Catalog: packages/nautilus-open-any-terminal/nautilus_open_any_terminal-0.7.0-py3-none-any.whl/nautilus_open_any_terminal/locale/*.po
Languages: tr

source: Open in Remote {}
tr: Uzak {} ile Aç

source: Open Remote {} in {}
tr: Uzaktaki {1}'i {0} ile Aç

source: Open in Local {}
tr: Yerel {} İle Aç

source: Open Local {} in {}
tr: Yereldeki {1}'i {0} İçinde Aç

source: Open Remote {} Here
tr: Burada Uzak {} Aç

source: Open Remote {} in This Directory
tr: Bu Dizini Uzak {} ile Aç

source: Open Local {} Here
tr: Burada Yerel {} Aç

source: Open Local {} in This Directory
tr: Bu Dizini Yerel {} ile Aç

source: Open in {}
tr: {} İçinde Aç

source: Open {} in {}
tr: {1} {0} İçinde Aç

source: Open {} Here
tr: Burada {} Aç

source: Open {} in This Directory
tr: Bu Dizide {} Aç

source: Execute in Remote {}
tr: Uzak {} İle Çalıştır

source: Execute {} in {} via SSH
tr: SSH üzerinden {1} konumunda {0} ile çalıştır

source: Execute in Local {}
tr: Yerel {} İle Çalıştır

source: Execute {} in Local {}
tr: {} Dosyasını Yerel {} İle Çalıştır

source: Execute in {}
tr: {} İçinde Çalıştır

source: Execute {} in {}
tr: {} Dosyasını {} İle Çalıştır
