Repository: pypi-data/pypi-mirror-382
Catalog: packages/django-otp-webauthn/django_otp_webauthn-0.7.0-py3-none-any.whl/django_otp_webauthn/locale/*/LC_MESSAGES/djangojs.po
Languages: nl

source: Verification failed. A server error occurred.
nl: Verificatie mislukt. Er is een serverfout opgetreden.

source: An error occurred during verification.
nl: Er is een fout opgetreden tijdens de verificatie.

source: Verify with Passkey
nl: Verifieren met Passkey

source: Verifying...
nl: Verifiëren...

source: Verification failed. Could not retrieve parameters from the server.
nl: Verificatie mislukt. Kan geen verificatie parameters ophalen van de server.

source: Verification aborted.
nl: Verificatie afgebroken.

source: Verification canceled or not allowed.
nl: Verificatie geannuleerd of niet toegestaan.

source: Verification failed. An unknown error occurred.
nl: Verificatie mislukt. Er is een onbekende fout opgetreden.

source: Finishing verification...
nl: Verificatie afronden...

source: Verification failed. An unknown server error occurred.
nl: Verificatie mislukt. Er is een onbekende serverfout opgetreden.

source: Verification successful!
nl: Verificatie voltooid!

source: Register a Passkey
nl: Registreer een Passkey

source: Registering...
nl: Registreren...

source: Registration failed. Unable to fetch registration options from server.
nl: Registratie mislukt. Kan registratieopties niet ophalen van de server.

source: Registration aborted.
nl: Registratie afgebroken.

source: Registration failed. You most likely already have a Passkey registered for this site.
nl: Registratie mislukt. Je hebt waarschijnlijk al een Passkey geregistreerd voor deze website.

source: Registration aborted or not allowed.
nl: Registratie afgebroken of niet toegestaan.

source: Registration failed. A technical problem occurred that prevents you from registering a Passkey for this site.
nl: Registratie mislukt. Er is een technisch probleem opgetreden waardoor je geen Passkey voor deze website kan registeren.

source: Registration failed. An unknown error occurred.
nl: Registratie mislukt. Er is een onbekende fout opgetreden.

source: Finishing registration...
nl: Registratie afronden...

source: Registration failed. The server was unable to verify this passkey.
nl: Registratie mislukt. De server kon deze Passkey niet verifiëren.

source: Registration failed. A server error occurred.
nl: Registratie mislukt. Er is een serverfout opgetreden.

source: Registration successful!
nl: Registratie voltooid!

source: An error occurred during registration.
nl: Er is een fout opgetreden tijdens de registratie.
